In [1]:
import pandas as pd
import numpy as np

In [5]:
df=pd.DataFrame(np.arange(0,16).reshape(4,4),index=['heart','spade','clover','diamond'],columns=["king","queen","jack","ace"])

In [3]:
df.head()

         king  queen  jack  ace
heart       0      1     2    3
spade       4      5     6    7
clover      8      9    10   11
diamond    12     13    14   15

In [6]:
df.to_csv('cards.csv')

In [7]:
df.loc['heart']

king     0
queen    1
jack     2
ace      3
Name: heart, dtype: int32

In [8]:
df.loc[['spade','clover']]

        king  queen  jack  ace
spade      4      5     6    7
clover     8      9    10   11

In [9]:
df.isnull().sum()

king     0
queen    0
jack     0
ace      0
dtype: int64

In [10]:
df['king'].value_counts()

0     1
4     1
8     1
12    1
Name: king, dtype: int64

In [11]:
df.max()

king     12
queen    13
jack     14
ace      15
dtype: int32

In [12]:
df.min()

king     0
queen    1
jack     2
ace      3
dtype: int32

In [13]:
df.count()

king     4
queen    4
jack     4
ace      4
dtype: int64

In [14]:
df.describe()

            king      queen       jack        ace
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000